In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
mySeries=pd.Series([1,2,3,4,5],index=['row1','row2','row3','row4','row5'])
mySeries

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int64

In [4]:
mySeries.values

array([1, 2, 3, 4, 5], dtype=int64)

In [5]:
mySeries.index

Index(['row1', 'row2', 'row3', 'row4', 'row5'], dtype='object')

In [6]:
mySeries.row2

2

In [7]:
mySeries['row2']

2

In [8]:
mySeries[mySeries>3]

row4    4
row5    5
dtype: int64

In [9]:
mySeries.rename({'row1':'a', 'row2':'b', 'row3':'c', 'row4':'d', 'row5':'e'})

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
myArrey=np.array([[1,5,9,13],[2,6,10,14],[3,7,11,15],[4,8,12,16]])
myDf=pd.DataFrame(myArrey,index=['row1', 'row2', 'row3', 'row4']
                  ,columns=['col1','col2','col3','col4'])
myDf

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [11]:
myDict={'col1':[1,2,3,4],'col2':[5,6,7,8],'col3':[9,10,11,12],'col4':[13,14,15,16]}
myDf2=pd.DataFrame(myDict,index=['row1', 'row2', 'row3', 'row4']
                  ,columns=['col1','col2','col3','col4'])
myDf2

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [12]:
myDf.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [13]:
myDf.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [14]:
myDf.values

array([[ 1,  5,  9, 13],
       [ 2,  6, 10, 14],
       [ 3,  7, 11, 15],
       [ 4,  8, 12, 16]])

In [15]:
myDf.loc['row1']['col2']

5

In [16]:
myDf.iloc[0][1]

5

In [17]:
myDf['col5']=[20,21,22,23]

In [18]:
myDf

      col1  col2  col3  col4  col5
row1     1     5     9    13    20
row2     2     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

In [19]:
myDf.loc[['row1','row2'],'col1']=0

In [20]:
myDf

      col1  col2  col3  col4  col5
row1     0     5     9    13    20
row2     0     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

In [21]:
myDf.reset_index(drop=True,inplace=True)
myDf

   col1  col2  col3  col4  col5
0     0     5     9    13    20
1     0     6    10    14    21
2     3     7    11    15    22
3     4     8    12    16    23

In [22]:
myDf.drop('col5',axis=1,inplace=True)
myDf

   col1  col2  col3  col4
0     0     5     9    13
1     0     6    10    14
2     3     7    11    15
3     4     8    12    16

In [23]:
myDf.rename(columns={'col4':'c4'},inplace=True)
myDf

   col1  col2  col3  c4
0     0     5     9  13
1     0     6    10  14
2     3     7    11  15
3     4     8    12  16

In [26]:
myDf=myDf.replace(0,1)

In [27]:
myDf

   col1  col2  col3  c4
0     1     5     9  13
1     1     6    10  14
2     3     7    11  15
3     4     8    12  16

In [28]:
myDf.col1=['{:.2f}'.format(x) for x in myDf.iloc[:,0]]
myDf

   col1  col2  col3  c4
0  1.00     5     9  13
1  1.00     6    10  14
2  3.00     7    11  15
3  4.00     8    12  16

In [29]:
myDf['col2']=myDf['col2'].apply(lambda x:'{:.2f}'.format(x))
myDf

   col1  col2  col3  c4
0  1.00  5.00     9  13
1  1.00  6.00    10  14
2  3.00  7.00    11  15
3  4.00  8.00    12  16

In [35]:
myDf.sort_index(axis=0,ascending=False)

   col1  col2  col3  c4
3  4.00  8.00    12  16
2  3.00  7.00    11  15
1  1.00  6.00    10  14
0  1.00  5.00     9  13

In [36]:
myDf.sort_values(by='col1',ascending=False)

   col1  col2  col3  c4
3  4.00  8.00    12  16
2  3.00  7.00    11  15
0  1.00  5.00     9  13
1  1.00  6.00    10  14

In [37]:
myDf.head(2)

   col1  col2  col3  c4
0  1.00  5.00     9  13
1  1.00  6.00    10  14

In [38]:
myDf.tail(2)

   col1  col2  col3  c4
2  3.00  7.00    11  15
3  4.00  8.00    12  16

In [39]:
data=pd.read_csv('D://smartphones.csv')
data

                Name        OS  Capacity  Ram  Weight    Company  inch
0         Galaxy S10   Android       128    8   163.0    Samsung   6.2
1          Lumia 950  windows         32    3   150.0  Microsoft   5.2
2        Xpreia 1 ll   Android       256    8   181.0       Sony   6.5
3          iphone 7        ios       128    2   138.0      Apple   4.7
4            U Ultra   Android        64    4   170.0        HTC   5.7
5          Galaxy S5   Android        16    2   145.0    Samsung   5.1
6  iphone 11 pro max       ios       256    4   226.0      Apple   6.5
7            Moto G5   Android        16    3   144.5   Motorola   5.0
8             Pixel    Android       128    4   143.0     Google   5.0